import wave
from piper import PiperVoice

voice = PiperVoice.load("fa_IR-amir-medium.onnx")
with wave.open("out.wav", "wb") as wav_file:
    voice.synthesize_wav("به گزارش فرارو به نقل از القاهره، نتانیاهو ادعا کرد که به موساد ارتش و نهادهای اطلاعاتی نظامی دستور داده است تا در جهت سرنگونی ایران تلاش کنند. وی در ادامه ادعایش تأکید کرد که تهران در حال حاضر ضعیف‌تر از هر زمان دیگری است. وی افزود که فرصت باقی‌مانده تا انتخابات، موقعیتی را برای همکاری با دونالد ترامپ فراهم می‌کند تا به آنچه او «تهدید ایران» خواند، رسیدگی شود.  نتانیاهو به جزئیات درباره حمله‌ای مشخص یا زمان احتمالی آن اشاره نکرد. همچنین نتانیاهو از اتخاذ تدابیر امنیتی جدید پیش از برگزاری انتخابات کنست در ۲۷ اکتبر سخنی نگفت.  نتانیاهو پیش از این نیز مدعی شده بود: شواهدی در دست است مبنی بر این که دشمنان ما برای حمله به ما پیش از انتخابات کنست تلاش خواهند کرد.", wav_file)